package com.cskaoyan._01basic._03variable;

/**
 * 常量：
 * 在程序运行过程中，其值不会发生改变的量，是绝对不会发生改变的量才能称之为常量。
 *
 * @author Common-zhou
 * @since 2024-02-29 16:22
 */
public class Demo8 {
    public static void main(String[] args) {
        // 字面值常量，在Java代码中，所有直接写值的量都是字面值常量, 包括：
        // 1. 整数常量：直接写在代码中的整数都是。例如1、2、3等。
        // 2. 小数常量：直接写在代码中的小数都是。例如1.1、1.2、1.3等。
        // 3. 字符常量：直接写在代码中的，使用单引号引起来的字符都是。例如'A'、'a'等。
        // 4. 布尔常量：直接写在代码中的布尔值，只有true和false两个。
        // 5. 字符串常量：直接写在代码中的，使用双引号引起来的字符串都是。例如"HelloWorld"、"hello"等
        // 6. 空常量：空常量是引用数据类型独有的一种取值，只有null一个。（数组的时候会讲，这里先记一下）

        // 1.1 = 1.2;
    }
}
